In [1]:
import pandas as pd
data = {
    "Nombre": ["Ana", "Luis", "Carlos", "Sara"],
    "Edad": [25,30,22,27],
    "Ciudad": ["Madrid", "Barcelona", "Valencia", "Bilbao"]
}

df = pd.DataFrame(data)

In [2]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [3]:
df["Salario"]= [30000, 45000,38000,32000] ## agregar una nueva columna con datos
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [4]:
 df["Salario"]= df["Salario"] + 2000

In [5]:
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    32000
1    Luis    30  Barcelona    47000
2  Carlos    22   Valencia    40000
3    Sara    27     Bilbao    34000

In [6]:
nombres = df["Nombre"]

In [7]:
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [8]:
mayores_25 = df[df['Edad']> 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000

In [9]:
edades = df['Edad']

In [10]:
edades

0    25
1    30
2    22
3    27
Name: Edad, dtype: int64

In [11]:
mayores_25 = df[edades > 25]
mayores_25

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    47000
3   Sara    27     Bilbao    34000